app/Http/Controllers/CartController.php

    public function addToCart(Request $request)
    {
        $product = Product::find($request->input('id'));
---
select * from `products` where `products`.`id` = '3' limit 1