app/Http/Controllers/CategoryController.php

    public function index(Request $request)
    {
        $search = $request->input('name');
        if ($search) {
            $data = Category::where('name', 'like', '%' . $search . '%')->paginate(3);
            $data->appends(['name' => $search]);
        } else {
            $data = Category::paginate(3);
---
select * from `categories`

    public function create(Request $request)
    {
       $request->validate([
        'category'=>'required',
        'category' => 'required|min:4|max:20',
       ]);
        // Kiểm tra xem danh mục có tồn tại trong cơ sở dữ liệu không
        $existingCategory = Category::where('name', $request->category)->first();

        if ($existingCategory) {
            // Nếu danh mục đã tồn tại, hiển thị thông báo lỗi hoặc thực hiện xử lý tùy ý
            return redirect()->back()->with('error', 'Danh mục đã tồn tại.');
        }

        $data = new Category;

        $data->name = $request->category;

        $data->save();
---
select * from `categories` where `name` = 'aaaaaa' limit 1
insert into `categories` (`name`, `updated_at`, `created_at`) values ('aaaaaa', '2023-11-17 06:58:01', '2023-11-17 06:58:01')

    public function delete($id)
    {
        $data = Category::find($id);

        $data->delete();
---
select * from `categories` where `categories`.`id` = '8' limit 1
delete from `categories` where `id` = 8