app/Http/Controllers/CategoryPostController.php

    public function index()
    {
        //
        $categryPost = CategoryPost::all();
---
select * from `category_posts`