app/Http/Controllers/ProductController.php

select * from `posts` order by `created_at` desc limit 4
select * from `products` where `discount` > 0 and `status` = 'publish' limit 8
---
    public function getProductHome(){
        $all_post = Post::orderBy('created_at', 'desc')->take(4)->get();
        $products_sell = Product::where('discount', '>', 0)
                                ->where('status','=','publish')
                  ->take(8) // Replace 10 with the desired limit
                  ->get();

select * from `products` where `name` like '%c%' limit 5 offset 0
select count(*) as aggregate from `products` where `name` like '%c%'
select * from `products` limit 5 offset 0
select count(*) as aggregate from `products`
---
    public function index(Request $request)
    {
        $search = $request->input('name');
        if ($search) {
            $products = Product::where('name', 'like', '%' . $search . '%')->paginate(5);
            $products->appends(['name' => $search]);
        } else {
            $products = Product::paginate(5);

select * from `categories`
---
    public function create()
    {
        //
        $categories = Category::all();

select * from `products` where `products`.`id` = 1 limit 1
select `categories`.*, `category_product`.`product_id` as `pivot_product_id`, `category_product`.`category_id` as `pivot_category_id` from `categories` inner join `category_product` on `categories`.`id` = `category_product`.`category_id` where `category_product`.`product_id` = 1
---
    public function show(string $id)
    {
        // giải mã hoá id product trên url
        $urlDetail = $id;
        $strBefore = '493275427158023849218444922492048902';
        $strAfter = '94721074921748127486217101204231940921034921849280';
        $urlDetail = str_replace($strBefore, '', $urlDetail);
        $urlDetail = str_replace($strAfter, '', $urlDetail);
        $productId = (int)$urlDetail;
        // lấy sản phẩm chi tiết
        $product = Product::find($productId);
        // lấy sản phẩm tương tự
        $relatedPosts = Product::whereHas('categories', function ($query) use ($product) {
            $query->whereIn('categories.id', $product->categories->pluck('id'));
        })